cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'homebrew/cask-cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'jhawthorn/fzy'
## CLI

brew 'git'
brew 'libgit2'
brew 'hub'
brew 'vim'
brew 'ctags'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'go'
brew 'fortune'
brew 'sl' # Corrects bad typing
brew 'tree'
brew 'yadm'
brew 'mas'
brew 'git-crypt'
brew 'zplug'
brew 'fzy'
brew 'fzf'
brew 'yarn'
brew 'nmap'
brew 'diff-so-fancy'
brew 'node'

## Work
brew 'crowdin'
brew 'emp'
brew 'datawire/blackbird/telepresence'
cask 'osxfuse'

## Applications

cask 'google-chrome'
cask 'firefox'
cask 'cloudapp'
cask 'slack'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'spotify'
cask 'spotify-notifications'
cask 'lastpass'
cask 'teamviewer'
cask 'docker'
cask 'the-unarchiver'
cask 'keybase'
cask 'numi'
cask 'visual-studio-code'
cask 'postman'
cask 'mongodb-compass'
cask 'whatsapp'
cask 'zeplin'
cask 'notion'
cask 'zoomus'
cask 'mysqlworkbench'

## Fonts

cask 'font-menlo-for-powerline'
cask 'font-monoid-nerd-font'
