cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'jhawthorn/fzy'
## CLI

brew 'git'
brew 'vim'
brew 'tmux'
brew 'htop'
brew 'reattach-to-user-namespace'
brew 'sl' # Corrects bad typing
brew 'tree'
brew 'yadm'
brew 'mas'
brew 'zplug'
brew 'fzy'
brew 'fzf'
brew 'nmap'
brew 'diff-so-fancy'
brew 'nvm'

## Work


## Applications

cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'spotify'
cask 'docker'
cask 'visual-studio-code'
cask 'postman'
cask 'notion'

## Fonts

cask 'font-menlo-for-powerline'
cask 'font-monoid-nerd-font'
